في التعديل ععلا الحساب السابق قم بالمطالبة بكلمة المرور الرئيسية

اذا انطفء الويندوز بشكل مفاجء قد تتم المطالبة بتفعيل البرنامج خطءا 


تحسين 
loading 


جعل جميع النوافذ لها الشعار نفسه للبرنامج لرئيسي


اضافة زر تفعيل البرنامج اذا كان البرنامج في الفترة التجريبية 


في كلمة المرور لاول مرة اجعل المستخدم يدخل اجباريا 16 رمز من بينهم ارقام وحروف كبيرة وصغيرة ورموز


اضافة تذكير بضرورة تفعيل البرنامج في اقرب وقت واضهار مكان كتابة رمز التفعيل في 
dialog 
نفسه الذي يذكر المستخدم 
كما هو الامر في برنامج التحميل 
idman
