
في كلمة المرور لاول مرة 
اجعل المستخدم يدخل اجباريا 16 رمز من بينهم ارقام وحروف كبيرة وصغيرة ورموز



الإسم الكامل و البريد الإلكتروني ، الذي يدخله المستخدم في اول تسجيل بالبرنامج
لا يتم اضافته في برنامج افتراضيا عندما يقوم المستخدم بتفعيل
otp



لون الكارط الخاصة بالحساب الذي انتهت مدة صلاحية الكود الخاص به غير لونها الى اللون الاصفر


remove copy and paste password from the clipboard to avoid tampering


البرنامج عن التشغيل يبدوا بطيئا وهذا يعود الى انه يقوم بالتحقق من الحسابات التي تم انتهاء صلاحيتها
يجب ان يقوم بالتحقق من الحسابات التي تم انتهاء صلاحيتها فقط عند الدخول الى البرنامج وليس في الخلفية
ويجب ان يكون ذلك بشكل سريع وليس بطيئا


123456789hamzaSAADI@