في التعديل ععلا الحساب السابق او نسخ كلمة المرور حساب معين قم بالمطالبة بكلمة المرور الرئيسية
وعند الحذف اطلب اجوبة الاسئلة التي اجاب عليها اول مرة 


اذا انطفء الويندوز بشكل مفاجء قد تتم المطالبة بتفعيل البرنامج خطءا 


تحسين 
loading 


جعل جميع النوافذ لها الشعار نفسه للبرنامج لرئيسي


اضافة زر تفعيل البرنامج اذا كان البرنامج في الفترة التجريبية 


في كلمة المرور لاول مرة اجعل المستخدم يدخل اجباريا 16 رمز من بينهم ارقام وحروف كبيرة وصغيرة ورموز


اضافة تذكير بضرورة تفعيل البرنامج في اقرب وقت واضهار مكان كتابة رمز التفعيل في 
dialog 
نفسه الذي يذكر المستخدم 
كما هو الامر في برنامج التحميل 
idman



الإسم الكامل و البريد الإلكتروني ، الذي يدخله المستخدم في اول تسجيل بالبرنامج
لا يتم اضافته في برنامج افتراضيا عندما يقوم المستخدم بتفعيل


welcome + securevault pro setup wizard + tutorial + create secure backup + about securevault pro 
+ add new account+ settings + verify master password + security questinons + enable 2fa 