في التعديل ععلا الحساب السابق او نسخ كلمة المرور حساب معين قم بالمطالبة بكلمة المرور الرئيسية
وعند الحذف اطلب اجوبة الاسئلة التي اجاب عليها اول مرة 

في كلمة المرور لاول مرة اجعل المستخدم يدخل اجباريا 16 رمز من بينهم ارقام وحروف كبيرة وصغيرة ورموز


الإسم الكامل و البريد الإلكتروني ، الذي يدخله المستخدم في اول تسجيل بالبرنامج
لا يتم اضافته في برنامج افتراضيا عندما يقوم المستخدم بتفعيل
otp

welcome + securevault pro setup wizard + tutorial + create secure backup + about securevault pro 
+ add new account+ settings + verify master password + security questinons + enable 2fa 


عندما يريد المستخدم تعديل البيانات او نسخ كلمة المرور لا تطلب منه الاجابة على الاسئلة التي كتبها او مرة ، فقط اكتفي بالمطالبة بالماستر كود
