في التعديل ععلا الحساب السابق او نسخ كلمة المرور حساب معين قم بالمطالبة بكلمة المرور الرئيسية
وعند الحذف اطلب اجوبة الاسئلة التي اجاب عليها اول مرة 

في كلمة المرور لاول مرة اجعل المستخدم يدخل اجباريا 16 رمز من بينهم ارقام وحروف كبيرة وصغيرة ورموز


الإسم الكامل و البريد الإلكتروني ، الذي يدخله المستخدم في اول تسجيل بالبرنامج
لا يتم اضافته في برنامج افتراضيا عندما يقوم المستخدم بتفعيل
otp

welcome + securevault pro setup wizard + tutorial + create secure backup + about securevault pro 
+ add new account+ settings + verify master password + security questinons + enable 2fa 


tutorial dialog  تظهر حتى بعد اول مرة يتم فيها اضهارها وهذا مشكلة في البرنامج


التذكير بضرورة تغيير المودباس بعد اسابيع قليلة او شيء من هاذا القبيل
